import { Component, ElementRef, EventEmitter, HostListener, Input, Output } from '@angular/core';

@Component({
  selector: 'unievent-message-emoticon-panel',
  templateUrl: './message-emoticon-panel.component.html',
  styleUrls: ['./message-emoticon-panel.component.scss']
})
export class MessageEmoticonPanelComponent {
  @Input() darkMode = true;
  selectedCategory: string = '😊';
  categories: string[] = ['😊', '🐱', '🍴', '🏀', '🚗', '💡', '❤️', '🚩'];
  emojis: { [key: string]: string[] } = {
    '😊': ['😀', '😃', '😄', '😁', '😆', '😅', '😂', '🤣', '😊', '😇',
      '😉', '😌', '😍', '🥰', '😘', '😗', '😙', '😚', '😋', '😜',
      '😝', '😎', '🤓', '🧐', '😏', '😒', '😞', '😔', '😟', '😕',
      '🙁', '😣', '😖', '😫', '😤', '😢', '😭', '😦', '😧', '😨',
      '😩', '🤯', '😬', '😰', '😱', '😳', '🤪', '😵', '😷', '🤮',
      '😮', '🤐', '😲', '😥', '😪', '😓', '😩', '🥺', '😢', '😞',
      '😓', '😤', '😖', '😁', '😔', '😣', '😕', '😂', '😲', '🤢',
      '😭', '😱', '😰', '😨', '🤭', '🤫', '🤔', '🤨', '😎', '🥳',
      '😴', '🥱', '😪', '🤤', '😈', '👿', '👻', '💀', '🤖', '👽',
      '👾', '🤡', '💩', '👶', '👧', '🧒', '👦', '👩', '🧑', '👨',
      '👵', '🧓', '👴', '🎅', '🤶', '👼', '👸', '🤴', '👰', '🧙',
      '🧚', '🧛', '🧜', '🧝', '🧞', '🧟', '💂', '👳', '🧕', '👮',
      '👷', '💆', '💇', '🧖', '🛀', '🛌', '💌', '💋', '👅', '👂',
      '👃', '👁', '👀', '🧠'],
    '🐱': ['🐶', '🐱', '🐭', '🐹', '🐰', '🦊', '🦝', '🐻', '🐼', '🦘',
      '🦡', '🐨', '🐯', '🦁', '🐮', '🐷', '🐽', '🐸', '🐵', '🐒',
      '🐔', '🐧', '🐦', '🐤', '🐣', '🐥', '🦆', '🦢', '🦉', '🦚',
      '🦜', '🐺', '🐗', '🦔', '🐴', '🐎', '🦄', '🐝', '🐛', '🦋',
      '🐌', '🐞', '🐜', '🦗', '🕷', '🦂', '🦟', '🦠', '🐢', '🐍',
      '🦎', '🦖', '🐊', '🐢', '🐍', '🦎', '🦖', '🦕', '🐙', '🦑',
      '🦐', '🦀', '🐚', '🐠', '🐟', '🐡', '🐬', '🐳', '🐋', '🦈',
      '🐊', '🐅', '🐆', '🦓', '🐘', '🦏', '🐪', '🐫', '🦒', '🐃',
      '🐄', '🐎', '🐖', '🦌', '🐐', '🦍', '🐕', '🦮', '🐩', '🐾',
      '🦔', '🐉', '🐲', '🌵', '🎄', '🌲', '🌳', '🌴', '🌱', '🌿',
      '☘️', '🍀', '🍁', '🍂', '🍃'],
    '🍴': [
      '🍇', '🍈', '🍉', '🍊', '🍋', '🍌', '🍍', '🍎', '🍏', '🍐',
      '🍑', '🍒', '🍓', '🥝', '🍅', '🥥', '🥑', '🍆', '🥔', '🥕',
      '🌽', '🌶', '🥒', '🥬', '🥦', '🍄', '🥜', '🌰', '🍞', '🥐',
      '🥖', '🥨', '🥯', '🥞', '🧀', '🍖', '🍗', '🥩', '🥓', '🍔',
      '🍟', '🍕', '🌭', '🥪', '🍱', '🍲', '🍛', '🍜', '🍝', '🍠',
      '🍢', '🍣', '🍤', '🍥', '🥮', '🍡', '🥟', '🥠', '🥡', '🍦',
      '🍧', '🍨', '🍩', '🍪', '🎂', '🍰', '🧁', '🥧', '🍫', '🍬',
      '🍭', '🍮', '🍯', '🍼', '🥤', '☕', '🍵', '🍶', '🍾', '🍷',
      '🍸', '🍹', '🍺', '🍻', '🥂', '🥃', '🥤', '🥢', '🍽', '🍴',
      '🥄', '🔪', '🏺'
    ],
    '🏀': ['⚽', '🏀', '🏈', '⚾', '🎾', '🏐', '🏉', '🎱', '🎳', '⛸️',
      '🏂', '🏋️‍♂️', '🏋️‍♀️', '🤺', '🤼', '🤸', '⛷️', '🏇', '🏊‍♂️', '🏊‍♀️',
      '🤽‍♂️', '🤽‍♀️', '🚣‍♂️', '🚣‍♀️', '🧗‍♂️', '🧗‍♀️', '🚴‍♂️', '🚴‍♀️', '🚵‍♂️', '🚵‍♀️',
      '🏇', '🎿', '🏂', '🏌️‍♂️', '🏌️‍♀️', '🏄‍♂️', '🏄‍♀️', '🏊‍♂️', '🏊‍♀️', '🤽‍♂️',
      '🤽‍♀️', '⛹️‍♂️', '⛹️‍♀️', '🏋️‍♂️', '🏋️‍♀️', '🚴‍♂️', '🚴‍♀️', '🚵‍♂️', '🚵‍♀️', '🤸‍♂️',
      '🤸‍♀️', '🤺', '🤼‍♂️', '🤼‍♀️', '🤾‍♂️', '🤾‍♀️', '🏌️‍♂️', '🏌️‍♀️', '🧗‍♂️', '🧗‍♀️',
      '🏇', '🎿', '🏂', '🏋️‍♂️', '🏋️‍♀️', '🤺', '🤼‍♂️', '🤼‍♀️', '🤸‍♂️', '🤸‍♀️',
      '🤺', '🤼‍♂️', '🤼‍♀️', '🤾‍♂️', '🤾‍♀️', '🏌️‍♂️', '🏌️‍♀️', '🧗‍♂️', '🧗‍♀️', '🏆',
      '🎽', '🏅', '🥇', '🥈', '🥉', '🎖️', '🏵️', '🎗️'
    ],
    '🚗': [
      '🌍', '🌎', '🌏', '🌐', '🗺️', '🗾', '🏔️', '⛰️', '🌋', '🗻',
      '🏕️', '🏖️', '🏜️', '🏝️', '🏞️', '🏟️', '🏛️', '🏗️', '🧱', '🏘️',
      '🏚️', '🏠', '🏡', '🏢', '🏣', '🏤', '🏥', '🏦', '🏨', '🏩',
      '🏪', '🏫', '🏬', '🏭', '🏯', '🏰', '💒', '🗼', '🗽', '⛪',
      '🕌', '🛕', '⛩️', '🕍', '🕋', '⛲', '⛺', '🌁', '🌃', '🏙️',
      '🌄', '🌅', '🌆', '🌇', '🌉', '♨️', '🎠', '🎡', '🎢', '💈',
      '🚢', '🛴', '🚲', '🛵', '🏍️', '🛺', '🚗', '🚕', '🚆', '🚈',
      '🚂', '🚊', '🚉', '🚞', '🚝', '🚄', '🚅', '🚇', '🚋', '🚆'
    ],
    '💡': [
      '💡', '🔦', '🕯️', '🪔', '🏮', '📜', '📖', '📚', '📔', '📒',
      '📓', '📃', '📜', '📄', '📰', '🗞️', '📑', '🔖', '🏷️', '💰',
      '💴', '💵', '💶', '💷', '💸', '💳', '🧾', '💹', '💱', '💲',
      '📧', '📨', '📩', '📤', '📥', '📦', '📫', '📪', '📬', '📭',
      '📮', '✉️'
    ],
    '❤️': [
      '❤️', '💛', '💚', '💙', '💜', '🖤', '💔', '❣️', '💕', '💞',
      '💓', '💗', '💖', '💘', '💝', '💟', '☮️', '✝️', '☪️', '🕉️',
      '☸️', '✡️', '🔯', '🕎', '☯️', '☦️', '🛐', '⛎', '♈', '♉',
      '♊', '♋', '♌', '♍', '♎', '♏', '♐', '♑', '♒', '♓',
      '🆔', '⚛️', '🉑', '☢️', '☣️', '📴', '📳', '🈶', '🈚', '🈸',
      '🈺', '🈷️', '✴️', '🆚', '💮', '🉐', '㊙️', '㊗️', '🈴', '🈵',
      '🈹', '🈲', '🅰️', '🅱️', '🆎', '🆑', '🅾️', '🆘', '❌', '⭕',
      '🛑', '⛔', '📛', '🚫', '💯', '💢', '♨️', '🚷', '🚯', '🚳',
      '🚱', '🔞', '📵', '🚭', '❗', '❕', '❓', '❔', '‼️', '⁉️',
      '🔅', '🔆', '〽️', '⚠️', '🚸', '🔱', '⚜️', '🔰', '♻️', '✅',
      '🈯', '💹', '❇️', '✳️', '❎', '🌐', '💠', 'Ⓜ️', '🌀', '💤',
      '🏧', '🚾', '♿', '🅿️', '🈳', '🈂️', '🛂', '🛃', '🛄', '🛅',
      '🚻', '🚹', '🚺', '🚼', '🚻', '🚮', '🎦', '📶', '🈁', '🔣',
      'ℹ️', '🔤', '🔡', '🔠', '🆖', '🆗', '🆙', '🆒', '🆕', '🆓',
      '0️⃣', '1️⃣', '2️⃣', '3️⃣', '4️⃣', '5️⃣', '6️⃣', '7️⃣', '8️⃣', '9️⃣',
      '🔟', '🔢', '#️⃣', '*️⃣', '▶️', '⏸️', '⏯️', '⏹️', '⏺️', '⏭️',
      '⏮️', '⏩', '⏪', '🔀', '🔁', '🔂', '➡️', '⬅️', '⬆️', '⬇️',
      '↗️', '↘️', '↙️', '↖️', '↕️', '↔️', '↪️', '↩️', '⤴️', '⤵️',
      '🔄', '🔃', '🎵', '🎶', '➕', '➖', '➗', '✖️', '💲', '💱',
      '™️', '©️', '®️', '〰️', '➰', '➿', '🔚', '🔙', '🔛', '🔜', '☑️',
      '🔘', '⚪', '⚫', '🔴', '🔵', '🔺', '🔻', '🔸', '🔹', '🔶',
      '🔷', '🔳', '🔲', '🕐', '🕑', '🕒', '🕓', '🕔', '🕕', '🕖',
      '🕗', '🕘', '🕙', '🕚', '🕛', '🕜', '🕝', '🕞', '🕟', '🕠', '🕡',
      '🕢', '🕣', '🕤', '🕥', '🕦', '🕧'
    ],
    '🚩': [
      '🏁',
      '🎌',
      '🚩',
      '🏳️‍🌈',
      '🏴‍☠️'
    ]
  };
  emojiDescriptions: { [key: string]: string } = {
    '😊': 'Smiley e persone',
    '🐱': 'Animali e natura',
    '🍴': 'Cibo e bevande',
    '🏀': 'Attività',
    '🚗': 'Viaggi e Luoghi',
    '💡': 'Oggetti',
    '❤️': 'Simboli',
    '🚩': 'Bandiere'
  };
  emojiDescriptions2: { [key: string]: string } = {
    '😀': 'Faccina sorridente',
    '😃': 'Faccina sorridente con occhi sorridenti',
    '😄': 'Faccina sorridente con occhi sorridenti e occhi chiusi',
    '😁': 'Faccina sorridente con occhi sorridenti e sorriso aperto',
    '😆': 'Faccina con occhi sorridenti e bocca aperta a forma di "U"',
    '😅': 'Faccina sorridente con goccia di sudore',
    '😂': 'Faccina che ride a crepapelle',
    '🤣': 'Faccina che ride rotolando per terra',
    '😊': 'Faccina con occhi sorridenti e bocca chiusa',
    '😇': 'Faccina sorridente con aureola',
    '😉': 'Faccina che fa l\'occhiolino',
    '😌': 'Faccina soddisfatta con occhi chiusi',
    '😍': 'Faccina con occhi a cuore',
    '🥰': 'Faccina con occhi a cuore e viso sorridente',
    '😘': 'Faccina che manda un bacio',
    '😗': 'Faccina che bacia',
    '😙': 'Faccina che manda un bacio con occhi sorridenti',
    '😚': 'Faccina che bacia con occhi chiusi',
  }
  constructor(private elementRef: ElementRef) { }

  changeCategory(category: string): void {
    this.selectedCategory = category;
  }

  getEmojiDescription(emoji: string): string {
    return this.emojiDescriptions[emoji] || '';
  }

  @Output() emojiSelected = new EventEmitter<string>();
  @Output() closePanelEvent = new EventEmitter();

  selectEmoji(emoji: string): void {
    this.emojiSelected.emit(emoji);
  }

  @HostListener('document:click', ['$event'])
  handleClickOutside(event: Event) {
    let eventClassName = (event.target as HTMLElement).parentElement.getAttribute("class");
    if (!this.elementRef.nativeElement.contains(event.target) && (!eventClassName.includes("message-container") && !eventClassName.includes("emoji-button") && !eventClassName.includes("bi-emoji-smile"))) {
      this.closePanel();
    }
  }

  closePanel() {
    this.closePanelEvent.emit('');
  }

}
